InformationRegisters/АкцизныеМаркиЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АкцизныеМаркиЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАкцизныхМарок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АкцизнаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВскрытыеПотребительскиеУпаковкиИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВскрытыеПотребительскиеУпаковкиИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Склад</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОборудованиеРозливаИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВскрытыхПотребительскихУпаковокИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодключениеКегаКОборудованиюРозливаИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключения</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемСлива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ШтрихкодУпаковкиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АкцизныеМаркиЕГАИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗафиксироватьРезультатПроверкиИПодбора(ДеревоУпаковок, ОрганизацияЕГАИС) Экспорт
	
	АкцизныеМаркиКЗаписи = ПодготовитьДанныеЗаписиПакетно(ДеревоУпаковок);
	ВыполнитьЗаписьВРегистрПакетно(АкцизныеМаркиКЗаписи, ОрганизацияЕГАИС);
	
КонецПроцедуры

// Осуществляет запись в регистр по переданным данным.
//
// Параметры:
//  Данные - См. ПоляЗаписиСтатусаУпаковки
//  ЭтоКорректировкаОстатка - Булево - это установка остатка без инкрементирования количества частичного выбытия
//  ПроверятьЧастичноеВыбытие - Булево - проверять / изменять количество частичного выбытия
Процедура ВыполнитьЗаписьВРегистр(Данные, ЭтоКорректировкаОстатка = Ложь, ПроверятьЧастичноеВыбытие = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПроверятьЧастичноеВыбытие
		Или ЭтоКорректировкаОстатка  Тогда
		
		ДанныеЗаписи = ПоляЗаписиСтатусаУпаковки();
		ЗаполнитьЗначенияСвойств(ДанныеЗаписи, Данные);
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.АкцизныеМаркиЕГАИС");
		ЭлементБлокировки.УстановитьЗначение("ОрганизацияЕГАИС", ДанныеЗаписи.ОрганизацияЕГАИС);
		ЭлементБлокировки.УстановитьЗначение("АкцизнаяМарка",    ДанныеЗаписи.АкцизнаяМарка);
		
		Если Не ЭтоКорректировкаОстатка Тогда
			ЭлементБлокировки = БлокировкаДанных.Добавить(Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("КодМаркировки", ДанныеЗаписи.АкцизнаяМарка);
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			БлокировкаДанных.Заблокировать();
			
			Если Не ЭтоКорректировкаОстатка Тогда
				
				ДанныеВскрытия = РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС.ВскрытыеПотребительскиеУпаковкиПоКодуМаркировки(
					ДанныеЗаписи.АкцизнаяМарка, Истина)[ДанныеЗаписи.АкцизнаяМарка];
				Если ДанныеВскрытия <> Неопределено
					И (ДанныеВскрытия.Остаток - ДанныеЗаписи.КоличествоЧастичногоВыбытия) <= 0 Тогда
					РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС.УдалитьВскрытыеПотребительскиеУпаковки(ДанныеЗаписи.АкцизнаяМарка);
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ДанныеЗаписи.ОрганизацияЕГАИС);
				Запрос.УстановитьПараметр("АкцизнаяМарка",    ДанныеЗаписи.АкцизнаяМарка);
				Запрос.Текст =
				"ВЫБРАТЬ
				|	АкцизныеМаркиЕГАИС.КоличествоЧастичногоВыбытия
				|ИЗ
				|	РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
				|ГДЕ
				|	АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС
				|	И АкцизныеМаркиЕГАИС.АкцизнаяМарка = &АкцизнаяМарка";
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ДанныеЗаписи.КоличествоЧастичногоВыбытия = Выборка.КоличествоЧастичногоВыбытия + ДанныеЗаписи.КоличествоЧастичногоВыбытия;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДанныеЗаписи.КоличествоЧастичногоВыбытия <> 0
				И ДанныеЗаписи.Статус = Перечисления.СтатусыАкцизныхМарок.ВНаличии Тогда
				ДанныеЗаписи.Статус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка;
			КонецЕсли;
			
			МенеджерЗаписи = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи);
			МенеджерЗаписи.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	Иначе
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Данные);
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру полей регистра для заполнения (и последующей записи)
// 
// Возвращаемое значение:
//  Структура - поля таблицы регистра:
// * ОрганизацияЕГАИС - Неопределено, Произвольный - организация ЕГАИС.
// * АкцизнаяМарка - Неопределено, Произвольный - акцизная марка.
// * Статус - Неопределено, Произвольный - статус.
// * Справка2 - Неопределено, Произвольный - справка №2.
// * АлкогольнаяПродукция - Неопределено, Произвольный - алкогольная продукция. 
// * Основание - Неопределено, Произвольный - основание.
// * КоличествоЧастичногоВыбытия - Число - количество частичного выбытия.
Функция ПоляЗаписиСтатусаУпаковки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОрганизацияЕГАИС",            Неопределено);
	Результат.Вставить("АкцизнаяМарка",               Неопределено);
	Результат.Вставить("Статус",                      Неопределено);
	Результат.Вставить("Справка2",                    Неопределено);
	Результат.Вставить("АлкогольнаяПродукция",        Неопределено);
	Результат.Вставить("Основание",                   Неопределено);
	Результат.Вставить("КоличествоЧастичногоВыбытия", 0);
	
	Возврат Результат;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС";
	ИмяРегистра = "ОстаткиАлкогольнойПродукцииЕГАИС";
	
	// Акт постановки на баланс
	ТекстЗапросаМеханизмаПроведения = Документы.АктПостановкиНаБалансЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.АктПостановкиНаБалансЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
	// Акт списания
	ТекстЗапросаМеханизмаПроведения = Документы.АктСписанияЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.АктСписанияЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
	// Возврат из регистра №2
	ТекстЗапросаМеханизмаПроведения = Документы.ВозвратИзРегистра2ЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.ВозвратИзРегистра2ЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
	// Запрос остатков
	ТекстЗапросаМеханизмаПроведения = Документы.ОстаткиЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.ОстаткиЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
	// Передача в регистр №2
	ТекстЗапросаМеханизмаПроведения = Документы.ПередачаВРегистр2ЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.ПередачаВРегистр2ЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
	// Входящая ТТН
	ТекстЗапросаМеханизмаПроведения = Документы.ТТНВходящаяЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.ТТНВходящаяЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
	// Исходящая ТТН
	ТекстЗапросаМеханизмаПроведения = Документы.ТТНИсходящаяЕГАИС.АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
	Регистраторы = ОбновлениеИнформационнойБазыЕГАИС.РегистраторыДляПерепроведения(
		ТекстЗапросаМеханизмаПроведения,
		ПолноеИмяРегистра,
		"Документ.ТТНИсходящаяЕГАИС");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.АктПостановкиНаБалансЕГАИС");
	Регистраторы.Добавить("Документ.АктСписанияЕГАИС");
	Регистраторы.Добавить("Документ.ВозвратИзРегистра2ЕГАИС");
	Регистраторы.Добавить("Документ.ОстаткиЕГАИС");
	Регистраторы.Добавить("Документ.ПередачаВРегистр2ЕГАИС");
	Регистраторы.Добавить("Документ.ТТНВходящаяЕГАИС");
	Регистраторы.Добавить("Документ.ТТНИсходящаяЕГАИС");
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыЕГАИС.ПерезаписатьДвиженияИзОчереди(
		Регистраторы,
		"РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС",
		Параметры.Очередь);
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗафиксироватьРезультатПроверкиИПодбора

Функция ПодготовитьДанныеЗаписиПакетно(ДеревоУпаковок)
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Если СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
			И ЗначениеЗаполнено(СтрокаДерева.ШтрихкодУпаковки)
			И ЗначениеЗаполнено(СтрокаДерева.Справка2)
			И КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(СтрокаДерева.ВидПродукции)
			И Не СтрокаДерева.ЧастичноеВыбытие Тогда
			
			ДанныеЗаписиСтатуса = ПоляЗаписиСтатусаУпаковки();
			ДанныеЗаписиСтатуса.АкцизнаяМарка        = СтрокаДерева.ШтрихкодУпаковки;
			ДанныеЗаписиСтатуса.Справка2             = СтрокаДерева.Справка2;
			ДанныеЗаписиСтатуса.АлкогольнаяПродукция = СтрокаДерева.АлкогольнаяПродукция;
			Результат.Добавить(ДанныеЗаписиСтатуса);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ПодготовитьДанныеЗаписиПакетно(СтрокаДерева));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Осуществляет запись в регистр по переданным данным.
// 
// Параметры:
//  ДанныеДляЗаписи - См. ПодготовитьДанныеЗаписиПакетно
//  ОрганизацияЕГАИС - СправочникСсылка.КлассификаторОрганизацийЕГАИС - Организация ЕГАИС
Процедура ВыполнитьЗаписьВРегистрПакетно(ДанныеДляЗаписи, ОрганизацияЕГАИС)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МаркиПроверитьНаличие = Новый Массив;
	
	Для Каждого Данные Из ДанныеДляЗаписи Цикл
		МаркиПроверитьНаличие.Добавить(Данные.АкцизнаяМарка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("Марки", МаркиПроверитьНаличие);
	Запрос.Текст = "ВЫБРАТЬ
	|	АкцизнаяМарка КАК АкцизнаяМарка
	|ИЗ
	|	РегистрСведений.АкцизныеМаркиЕГАИС
	|ГДЕ
	|	ОрганизацияЕГАИС = &ОрганизацияЕГАИС
	|	И АкцизнаяМарка В (&Марки)";
	МаркиПроверитьНаличие = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		МаркиПроверитьНаличие, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АкцизнаяМарка"));
	
	Если МаркиПроверитьНаличие.Количество() Тогда
		
		НаборЗаписей = СоздатьНаборЗаписей();
		Для Каждого Данные Из ДанныеДляЗаписи Цикл
			Если МаркиПроверитьНаличие.Найти(Данные.АкцизнаяМарка)<> Неопределено Тогда
				НоваяСтрока = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Данные);
				НоваяСтрока.ОрганизацияЕГАИС = ОрганизацияЕГАИС;
				НоваяСтрока.Статус = Перечисления.СтатусыАкцизныхМарок.НеПодтверждена;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
